-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 24, 2026 at 05:27 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `entekhabat`
--

-- --------------------------------------------------------

--
-- Table structure for table `advertisements`
--

CREATE TABLE `advertisements` (
  `id` int(11) NOT NULL,
  `nationalId` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_persian_ci NOT NULL,
  `title` text NOT NULL,
  `create_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `description` text NOT NULL,
  `image` varchar(200) NOT NULL,
  `type` varchar(30) NOT NULL,
  `status` varchar(20) NOT NULL,
  `start_date` varchar(20) DEFAULT NULL,
  `end_date` varchar(20) DEFAULT NULL,
  `views` int(11) NOT NULL,
  `target_link` varchar(200) DEFAULT NULL,
  `managerialRecords` text DEFAULT NULL,
  `academicRecords` text DEFAULT NULL,
  `honors` text DEFAULT NULL,
  `plans` text DEFAULT NULL,
  `slogan` text DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleter` varchar(15) DEFAULT NULL,
  `reson` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `advertisements`
--

INSERT INTO `advertisements` (`id`, `nationalId`, `title`, `create_date`, `description`, `image`, `type`, `status`, `start_date`, `end_date`, `views`, `target_link`, `managerialRecords`, `academicRecords`, `honors`, `plans`, `slogan`, `updated_at`, `deleter`, `reson`) VALUES
(8, '0534921973', '1', '2026-02-14 17:09:19', '2', 'uploads/advertisements/ad_20260214_203919_e591a451.png', 'banner', 'active', NULL, NULL, 8, '', '3', '4', '5', '6', '7', '2026-02-14 20:29:05', NULL, ''),
(9, '0534921973', '1', '2026-02-14 17:09:59', '2', 'uploads/advertisements/ad_20260214_203959_6fdf90f5.jpg', 'banner', 'active', NULL, NULL, 39, '', '3', '4', '5', '6', '7', '2026-02-14 20:33:06', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `api_rate_limits`
--

CREATE TABLE `api_rate_limits` (
  `id` int(11) NOT NULL,
  `ip` varchar(45) DEFAULT NULL,
  `route` varchar(100) DEFAULT NULL,
  `request_count` int(11) DEFAULT 1,
  `last_request` datetime DEFAULT NULL,
  `blocked_until` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `api_rate_limits`
--

INSERT INTO `api_rate_limits` (`id`, `ip`, `route`, `request_count`, `last_request`, `blocked_until`) VALUES
(39, '::1', 'getInfoVote', 3, '2026-02-23 00:27:12', NULL),
(40, '::1', 'AccountLogin', 1, '2026-02-24 19:55:17', NULL),
(41, '::1', 'getAdvertisements', 2, '2026-02-23 01:44:32', NULL),
(42, '::1', 'advertisementsSave', 2, '2026-02-14 20:39:59', NULL),
(43, '::1', 'deleteAdv', 2, '2026-02-23 01:47:05', NULL),
(44, '::1', 'getEXECUTIVEList', 1, '2026-02-23 00:36:33', NULL),
(45, '::1', 'increaseViewAdd', 2, '2026-02-15 00:03:06', NULL),
(47, '::1', 'saveSystemSchedule', 5, '2026-02-23 01:12:52', NULL),
(48, '::1', 'getVote', 2, '2026-02-15 20:34:49', NULL),
(49, '::1', 'createVoteToken', 2, '2026-02-15 20:34:49', NULL),
(50, '::1', 'getCandidsList', 2, '2026-02-15 20:34:49', NULL),
(51, '::1', 'getConfig', 1, '2026-02-24 19:55:18', NULL),
(52, '::1', 'user-status', 1, '2026-02-23 01:21:54', NULL),
(53, '::1', 'UploadUserDocuments', 1, '2026-02-23 01:22:08', NULL),
(54, '::1', 'FinalSubmit', 4, '2026-02-23 01:22:09', NULL),
(55, '::1', 'canselRequestCANDIDATE', 1, '2026-02-23 01:21:53', NULL),
(57, '::1', 'getSystemSchedule', 2, '2026-02-23 01:44:32', NULL),
(58, '::1', 'getRegions', 1, '2026-02-23 00:37:46', NULL),
(59, '::1', 'ChangeState', 2, '2026-02-21 21:29:00', NULL),
(60, '::1', 'getstateCandid', 1, '2026-02-24 19:55:18', NULL),
(61, '::1', 'UpdateDocumentReview', 4, '2026-02-21 21:28:54', NULL),
(62, '::1', 'getFinalResultsApprovalStatus', 1, '2026-02-24 19:55:18', NULL),
(63, '::1', 'submitFinalResultsApproval', 1, '2026-02-23 00:26:28', NULL),
(64, '::1', 'getObjections', 3, '2026-02-23 02:10:55', NULL),
(65, '::1', 'saveObjection', 1, '2026-02-23 02:07:51', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `config1`
--

CREATE TABLE `config1` (
  `id` int(11) NOT NULL,
  `startDate` timestamp NULL DEFAULT NULL,
  `EndDate` timestamp NULL DEFAULT NULL,
  `create_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `active` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `config1`
--

INSERT INTO `config1` (`id`, `startDate`, `EndDate`, `create_date`, `active`) VALUES
(1, '2026-02-16 04:30:00', '2026-02-17 18:30:00', '2026-02-06 18:07:17', 1);

-- --------------------------------------------------------

--
-- Table structure for table `election_participants`
--

CREATE TABLE `election_participants` (
  `id` int(11) NOT NULL,
  `national_id` varchar(10) NOT NULL,
  `tracking_code` varchar(20) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `election_participants`
--

INSERT INTO `election_participants` (`id`, `national_id`, `tracking_code`, `created_at`) VALUES
(9, '0534921973', '3F2402CC5BA8', '2026-02-09 00:59:27');

-- --------------------------------------------------------

--
-- Table structure for table `election_schedule_events`
--

CREATE TABLE `election_schedule_events` (
  `id` int(11) NOT NULL,
  `event_key` varchar(100) NOT NULL,
  `event_name` varchar(255) NOT NULL,
  `start_date` datetime DEFAULT NULL,
  `end_date` datetime DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `updated_by` varchar(20) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `election_schedule_events`
--

INSERT INTO `election_schedule_events` (`id`, `event_key`, `event_name`, `start_date`, `end_date`, `sort_order`, `updated_by`, `created_at`, `updated_at`) VALUES
(1, 'candidate_registration', 'ثبت نام داوطلبان', '1404-11-22 00:00:00', '1404-12-05 00:00:00', 1, '0534921973', '2026-02-15 00:20:50', '2026-02-23 01:12:52'),
(2, 'supervision_review', 'بررسی نتایج در هیات نظارت', '1404-11-22 00:37:00', '1404-12-08 00:37:00', 2, '0534921973', '2026-02-15 00:20:50', '2026-02-23 01:12:52'),
(3, 'first_stage_announce', 'اعلام نتایج مرحله اول', NULL, NULL, 3, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(4, 'first_stage_objection', 'اعتراض به نتایج مرحله اول', NULL, NULL, 4, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(5, 'first_stage_final_announce', 'اعلام نتیجه پس از بررسی مرحله اول', NULL, NULL, 5, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(6, 'ads_upload_start', 'شروع بارگذاری اقلام تبلیغات', '1404-12-10 02:00:00', '1404-12-15 20:00:00', 6, '0534921973', '2026-02-15 00:20:50', '2026-02-23 01:12:52'),
(7, 'ads_review_approve', 'بررسی تبلیغات/تایید', NULL, NULL, 7, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(8, 'campaign_start', 'شروع تبلیغات', '1404-12-16 02:30:00', NULL, 8, '0534921973', '2026-02-15 00:20:50', '2026-02-23 01:12:52'),
(9, 'voting', 'رای گیری', '1404-12-17 06:00:00', '1404-12-18 22:32:00', 9, '0534921973', '2026-02-15 00:20:50', '2026-02-23 01:12:52'),
(10, 'results_announce', 'اعلام نتایج', NULL, NULL, 10, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(11, 'objections_registration', 'ثبت اعتراضات', NULL, NULL, 11, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(12, 'final_results_announce', 'اعلام نتایج نهایی', NULL, NULL, 12, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50'),
(13, 'certificate_issue', 'صدور ابلاغ و گواهی فعالیت', NULL, NULL, 13, '0534921973', '2026-02-15 00:20:50', '2026-02-15 00:20:50');

-- --------------------------------------------------------

--
-- Table structure for table `feedback`
--

CREATE TABLE `feedback` (
  `id` int(11) NOT NULL,
  `national_id` varchar(20) NOT NULL,
  `rating` tinyint(4) NOT NULL DEFAULT 0,
  `comment` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `feedback`
--

INSERT INTO `feedback` (`id`, `national_id`, `rating`, `comment`, `created_at`) VALUES
(15, '0534921973', 4, '12123', '2026-02-08 22:08:25');

-- --------------------------------------------------------

--
-- Table structure for table `final_results_approvals`
--

CREATE TABLE `final_results_approvals` (
  `id` int(11) NOT NULL,
  `executive_approved` tinyint(1) NOT NULL DEFAULT 0,
  `supervisor_approved` tinyint(1) NOT NULL DEFAULT 0,
  `is_active` tinyint(1) NOT NULL DEFAULT 0,
  `executive_approved_by` varchar(20) DEFAULT NULL,
  `executive_approved_at` datetime DEFAULT NULL,
  `supervisor_approved_by` varchar(20) DEFAULT NULL,
  `supervisor_approved_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `final_results_approvals`
--

INSERT INTO `final_results_approvals` (`id`, `executive_approved`, `supervisor_approved`, `is_active`, `executive_approved_by`, `executive_approved_at`, `supervisor_approved_by`, `supervisor_approved_at`, `updated_at`, `created_at`) VALUES
(1, 0, 0, 0, '0534921973', '2026-02-23 00:26:28', '0534921973', '2026-02-23 00:20:37', '2026-02-23 00:27:18', '2026-02-23 00:07:29');

-- --------------------------------------------------------

--
-- Table structure for table `final_submissions`
--

CREATE TABLE `final_submissions` (
  `id` int(11) NOT NULL,
  `nationalId` varchar(20) NOT NULL,
  `tracking_code` varchar(100) NOT NULL,
  `requestStatus` varchar(30) NOT NULL,
  `reson` text DEFAULT NULL,
  `create_date` datetime DEFAULT current_timestamp(),
  `edited_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `final_submissions`
--

INSERT INTO `final_submissions` (`id`, `nationalId`, `tracking_code`, `requestStatus`, `reson`, `create_date`, `edited_at`) VALUES
(18, '4269875895', '165E6451', 'SUPERVISION_APPROVED', '11', '2026-02-21 20:47:38', '2026-02-21 21:29:00'),
(22, '0534921973', 'F2F5C3D7', 'SUPERVISION_REJECTED', '123', '2026-02-23 01:22:09', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `logs`
--

CREATE TABLE `logs` (
  `id` int(11) NOT NULL,
  `nationalId` varchar(20) NOT NULL,
  `action` varchar(150) NOT NULL,
  `create_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `logs`
--

INSERT INTO `logs` (`id`, `nationalId`, `action`, `create_date`, `description`) VALUES
(2, '0534921973', 'تغییر وضعیت', '2026-02-06 13:48:12', 'تغییر کدملی 0534921972 به SUPERVISION_REJECTED'),
(3, '0534921973', 'تغییر وضعیت', '2026-02-06 13:49:05', 'تغییر کدملی 0534921972 به SUPERVISION_APPROVED'),
(4, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:39:29', 'تغییر کد 2 به 1'),
(5, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:40:13', 'تغییر کد 2 به 1'),
(6, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:40:49', 'تغییر کد 2 به 1'),
(7, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:42:39', 'تغییر کد 6 به 1'),
(8, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:49:49', 'تغییر کد 6 به 1'),
(9, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:50:39', 'تغییر کد 6 به 1'),
(10, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:51:26', 'تغییر کد 6 به 0'),
(11, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 16:51:52', 'تغییر کد 6 به 1'),
(12, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:03:31', 'تغییر کد 5 به 1'),
(13, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:03:41', 'تغییر کد 6 به 0'),
(14, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:18:15', 'تغییر کد 5 به 0'),
(15, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:18:33', 'تغییر کد 5 به 1'),
(16, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:19:55', 'تغییر کد 5 به 0'),
(17, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:20:09', 'تغییر کد 5 به 1'),
(18, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:25:41', 'تغییر کد 6 به SUPERVISOR'),
(19, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:26:17', 'تغییر کد 6 به 0'),
(20, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:27:33', 'تغییر کد 6 به SUPERVISOR'),
(21, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-06 17:27:53', 'تغییر کد 6 به '),
(22, '0534921972', 'تغییر وضعیت تبلیغ', '2026-02-06 17:55:10', 'تغییر کد 5 به CANDIDATE'),
(23, '0534921972', 'ثبت رای', '2026-02-06 21:08:46', ' کد 0534921972 به 5 رای داد'),
(24, '0534921972', 'ثبت رای', '2026-02-07 00:08:11', ' کد 0534921972 به 2 رای داد'),
(25, '0534921973', 'ثبت کاندید', '2026-02-08 17:16:21', 'تغییر کد 0534921973 ثبت نام کرد'),
(30, '0534921973', 'ثبت رای', '2026-02-08 20:19:20', ' کد 0534921973 به 4 رای داد'),
(31, '0534921973', 'ثبت رای', '2026-02-08 20:19:20', ' کد 0534921973 به 2 رای داد'),
(32, '0534921973', 'ثبت رای', '2026-02-08 20:20:35', ' کد 0534921973 به 4 رای داد'),
(33, '0534921973', 'ثبت رای', '2026-02-08 20:20:35', ' کد 0534921973 به 2 رای داد'),
(34, '0534921973', 'ثبت رای', '2026-02-08 21:15:39', ' کد 0534921973 به 4 رای داد'),
(35, '0534921973', 'ثبت رای', '2026-02-08 21:15:39', ' کد 0534921973 به 2 رای داد'),
(36, '0534921973', 'ثبت رای', '2026-02-08 21:23:16', ' کد 0534921973 به 4 رای داد'),
(37, '0534921973', 'ثبت رای', '2026-02-08 21:23:16', ' کد 0534921973 به 2 رای داد'),
(38, '0534921973', 'ثبت رای', '2026-02-08 21:25:57', ' کد 0534921973 به 4 رای داد'),
(39, '0534921973', 'ثبت رای', '2026-02-08 21:25:57', ' کد 0534921973 به 2 رای داد'),
(40, '0534921973', 'ثبت رای', '2026-02-08 21:29:27', ' کد 0534921973 به 4 رای داد'),
(41, '0534921973', 'ثبت رای', '2026-02-08 21:29:27', ' کد 0534921973 به 2 رای داد'),
(42, '0534921973', 'ثبت رای', '2026-02-08 21:32:57', ' کد 0534921973 به 4 رای داد'),
(43, '0534921973', 'ثبت رای', '2026-02-08 21:32:57', ' کد 0534921973 به 2 رای داد'),
(44, '0534921973', 'ثبت رای', '2026-02-08 21:33:45', ' کد 0534921973 به 4 رای داد'),
(45, '0534921973', 'ثبت رای', '2026-02-08 21:33:45', ' کد 0534921973 به 2 رای داد'),
(46, '0534921973', 'ثبت رای', '2026-02-08 21:36:04', ' کد 0534921973 به 4 رای داد'),
(47, '0534921973', 'ثبت رای', '2026-02-08 21:36:04', ' کد 0534921973 به 2 رای داد'),
(48, '0534921973', 'ثبت رای', '2026-02-08 21:37:34', ' کد 0534921973 به 4 رای داد'),
(49, '0534921973', 'ثبت رای', '2026-02-08 21:37:34', ' کد 0534921973 به 2 رای داد'),
(50, '0534921973', 'ثبت رای', '2026-02-08 21:38:46', ' کد 0534921973 به 2 رای داد'),
(51, '0534921973', 'ثبت رای', '2026-02-08 21:38:46', ' کد 0534921973 به 4 رای داد'),
(52, '0534921973', 'ثبت رای', '2026-02-08 21:42:46', ' کد 0534921973 به 2 رای داد'),
(53, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-14 17:11:12', 'تغییر کد 8 به CANDIDATE'),
(54, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-14 18:01:38', 'تغییر کد 9 به CANDIDATE'),
(55, '0534921973', 'تغییر وضعیت تبلیغ', '2026-02-14 18:07:19', 'تغییر کد 9 به CANDIDATE'),
(56, '0534921973', 'ثبت کاندید', '2026-02-17 21:28:03', 'تغییر کد 0534921973 ثبت نام کرد'),
(57, '0534921973', 'حذف کاندید', '2026-02-17 21:36:53', 'حذف کاندید توسط خودش'),
(58, '0534921973', 'حذف کاندید', '2026-02-17 21:37:16', 'حذف کاندید توسط خودش'),
(59, '0534921973', 'حذف کاندید', '2026-02-17 21:43:20', 'حذف کاندید توسط خودش'),
(60, '0534921973', 'حذف کاندید', '2026-02-17 21:47:07', 'حذف کاندید توسط خودش'),
(61, '0534921973', 'حذف کاندید', '2026-02-17 21:47:54', 'حذف کاندید توسط خودش'),
(62, '0534921973', 'ثبت کاندید', '2026-02-17 21:50:15', 'تغییر کد 0534921973 ثبت نام کرد'),
(63, '0534921973', 'حذف کاندید', '2026-02-17 21:50:18', 'حذف کاندید توسط خودش'),
(64, '0534921973', 'ثبت کاندید', '2026-02-17 21:50:35', 'تغییر کد 0534921973 ثبت نام کرد'),
(65, '0534921973', 'حذف کاندید', '2026-02-17 21:57:59', 'حذف کاندید توسط خودش'),
(66, '0534921973', 'ثبت کاندید', '2026-02-17 21:58:37', 'تغییر کد 0534921973 ثبت نام کرد'),
(67, '0534921973', 'حذف کاندید', '2026-02-17 21:58:42', 'حذف کاندید توسط خودش'),
(68, '0534921973', 'ثبت کاندید', '2026-02-17 22:00:54', 'تغییر کد 0534921973 ثبت نام کرد'),
(69, '0534921973', 'ثبت کاندید', '2026-02-17 22:03:09', 'تغییر کد 0534921973 ثبت نام کرد'),
(70, '0534921973', 'حذف کاندید', '2026-02-17 22:05:47', 'حذف کاندید توسط خودش'),
(71, '0534921973', 'ثبت کاندید', '2026-02-17 22:06:08', 'تغییر کد 0534921973 ثبت نام کرد'),
(72, '0534921973', 'تغییر وضعیت', '2026-02-21 13:35:34', 'تغییر کدملی 0534921973 به SUPERVISION_APPROVED'),
(73, '0534921973', 'ثبت کاندید', '2026-02-21 17:17:38', 'تغییر کد 0534921973 ثبت نام کرد'),
(74, '0534921973', 'بررسی مدرک', '2026-02-21 17:43:52', 'بررسی user_photo برای 0534921973 با وضعیت approved'),
(75, '0534921973', 'بررسی مدرک', '2026-02-21 17:49:58', 'بررسی user_photo برای 0534921973 با وضعیت approved'),
(76, '0534921973', 'بررسی مدرک', '2026-02-21 17:58:24', 'بررسی employment_cert برای 0534921973 با وضعیت rejected'),
(77, '0534921973', 'بررسی مدرک', '2026-02-21 17:58:30', 'بررسی employment_cert برای 0534921973 با وضعیت approved'),
(78, '0534921973', 'تغییر وضعیت', '2026-02-21 17:58:34', 'تغییر کدملی 0534921973 به SUPERVISION_APPROVED'),
(79, '0534921973', 'بررسی مدرک', '2026-02-21 17:58:51', 'بررسی user_photo برای 0534921973 با وضعیت rejected'),
(80, '0534921973', 'بررسی مدرک', '2026-02-21 17:58:54', 'بررسی user_photo برای 0534921973 با وضعیت approved'),
(81, '0534921973', 'تغییر وضعیت', '2026-02-21 17:59:00', 'تغییر کدملی 0534921973 به SUPERVISION_REJECTED'),
(82, '0534921973', 'ثبت کاندید', '2026-02-22 21:44:18', 'تغییر کد 0534921973 ثبت نام کرد'),
(83, '0534921973', 'حذف کاندید', '2026-02-22 21:49:13', 'حذف کاندید توسط خودش'),
(84, '0534921973', 'ثبت کاندید', '2026-02-22 21:50:27', 'تغییر کد 0534921973 ثبت نام کرد'),
(85, '0534921973', 'ثبت کاندید', '2026-02-22 21:51:32', 'تغییر کد 0534921973 ثبت نام کرد'),
(86, '0534921973', 'حذف کاندید', '2026-02-22 21:51:53', 'حذف کاندید توسط خودش'),
(87, '0534921973', 'ثبت کاندید', '2026-02-22 21:52:09', 'تغییر کد 0534921973 ثبت نام کرد'),
(88, '0534921973', 'ثبت اعتراض', '2026-02-22 22:37:51', 'ثبت اعتراض با کد 202602230207510355');

-- --------------------------------------------------------

--
-- Table structure for table `maxvotes`
--

CREATE TABLE `maxvotes` (
  `id` int(11) NOT NULL,
  `maxVotes` int(11) NOT NULL,
  `region_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `maxvotes`
--

INSERT INTO `maxvotes` (`id`, `maxVotes`, `region_id`) VALUES
(1, 2, 1000);

-- --------------------------------------------------------

--
-- Table structure for table `objections`
--

CREATE TABLE `objections` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tracking_code` varchar(30) NOT NULL,
  `national_id` varchar(20) NOT NULL,
  `decision_type` varchar(80) DEFAULT NULL,
  `case_number` varchar(80) DEFAULT NULL,
  `candidate_name` varchar(255) DEFAULT NULL,
  `candidate_region` varchar(255) DEFAULT NULL,
  `candidate_position` varchar(255) DEFAULT NULL,
  `subject` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `reasons` text DEFAULT NULL,
  `urgency` varchar(20) DEFAULT 'normal',
  `status` varchar(30) DEFAULT 'pending',
  `declaration` tinyint(1) DEFAULT 1,
  `response_text` text DEFAULT NULL,
  `response_by` varchar(20) DEFAULT NULL,
  `response_at` datetime DEFAULT NULL,
  `cancelled_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `objections`
--

INSERT INTO `objections` (`id`, `tracking_code`, `national_id`, `decision_type`, `case_number`, `candidate_name`, `candidate_region`, `candidate_position`, `subject`, `description`, `reasons`, `urgency`, `status`, `declaration`, `response_text`, `response_by`, `response_at`, `cancelled_at`, `created_at`, `updated_at`) VALUES
(1, '202602230207510355', '0534921973', 'candidate_rejection', '1111', '11', '22', '33', '111', '2221111123123123123 2221111123123123123 2221111123123123123 2221111123123123123 2221111123123123123 2221111123123123123', '[]', 'normal', 'pending', 1, NULL, NULL, NULL, NULL, '2026-02-23 02:07:51', '2026-02-23 02:07:51');

-- --------------------------------------------------------

--
-- Table structure for table `region`
--

CREATE TABLE `region` (
  `id` int(11) NOT NULL,
  `ProvinceCode` int(11) NOT NULL,
  `Name` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `region`
--

INSERT INTO `region` (`id`, `ProvinceCode`, `Name`) VALUES
(1000, 10, 'حوزه ستادى'),
(1021, 10, 'پژوهشكده تعليم وتربيت'),
(1022, 10, 'مشاركت هاى مردمي'),
(1063, 10, 'تعلیم و تربیت کودک'),
(1070, 10, 'كانون پرورش فكرى كودكان ونوجوانان'),
(1100, 11, 'تهران .اداره كل'),
(1101, 11, 'تهران .منطقه 1'),
(1102, 11, 'تهران .منطقه 2'),
(1103, 11, 'تهران .منطقه 3'),
(1104, 11, 'تهران .منطقه 4'),
(1105, 11, 'تهران .منطقه 5'),
(1106, 11, 'تهران .منطقه 6'),
(1107, 11, 'تهران .منطقه 7'),
(1108, 11, 'تهران .منطقه 8'),
(1109, 11, 'تهران .منطقه 9'),
(1110, 11, 'تهران .منطقه 10'),
(1111, 11, 'تهران .منطقه 11'),
(1112, 11, 'تهران .منطقه 12'),
(1113, 11, 'تهران .منطقه 13'),
(1114, 11, 'تهران .منطقه 14'),
(1115, 11, 'تهران .منطقه 15'),
(1116, 11, 'تهران .منطقه 16'),
(1117, 11, 'تهران .منطقه 17'),
(1118, 11, 'تهران .منطقه 18'),
(1119, 11, 'تهران .منطقه 19'),
(1141, 11, 'منطقه_اداره کل استثنایی شهرتهران '),
(1200, 12, 'شهرستانهاى تهران .اداره كل'),
(1211, 12, 'فشافويه'),
(1212, 12, 'منطقه_اداره کل استثنایی شهرستانهای تهران '),
(1215, 12, 'كهريزك'),
(1217, 12, 'شهرقدس'),
(1220, 12, 'شهررى .ناحيه 1'),
(1221, 12, 'شهررى .ناحيه 2'),
(1251, 12, 'شهريار'),
(1253, 12, 'ملارد'),
(1255, 12, 'رباطكريم'),
(1257, 12, 'اداره کل استثنایی '),
(1271, 12, 'ورامين'),
(1272, 12, 'قرچك'),
(1273, 12, 'جوادآباد'),
(1275, 12, 'پاكدشت'),
(1281, 12, 'دماوند'),
(1283, 12, 'رودهن'),
(1285, 12, 'فيروزكوه'),
(1287, 12, 'پيشوا'),
(1289, 12, 'چهاردانگه'),
(1292, 12, 'اسلام شهر'),
(1294, 12, 'بهارستان 1'),
(1295, 12, 'بهارستان 2'),
(1296, 12, 'پرديس'),
(1430, 14, 'سازمان پژوهش وبرنامه ريزى وتاليف كتب'),
(1432, 14, 'دبيرخانه شوراى عالي وزارت آموزش وپر'),
(1500, 15, 'اراك .اداره كل'),
(1501, 15, 'اراك .ناحيه 1'),
(1502, 15, 'اراك .ناحيه 2'),
(1506, 15, 'کميجان'),
(1509, 15, 'خنداب (شرا )'),
(1520, 15, 'آشتيان'),
(1530, 15, 'تفرش'),
(1535, 15, 'فراهان'),
(1540, 15, 'ساوه'),
(1543, 15, 'زرنديه'),
(1545, 15, 'نوبران'),
(1550, 15, 'خمين'),
(1555, 15, 'محلات'),
(1570, 15, 'دليجان'),
(1580, 15, 'شازند(سربند )'),
(1581, 15, 'سربند'),
(1582, 15, 'منطقه_اداره کل استثنایی مرکزی '),
(1600, 16, 'مشهد.اداره كل'),
(1601, 16, 'مشهد.ناحيه 1'),
(1602, 16, 'مشهد.ناحيه 2'),
(1603, 16, 'مشهد.ناحيه 3'),
(1604, 16, 'مشهد.ناحيه 4'),
(1605, 16, 'مشهد.ناحيه 5'),
(1606, 16, 'مشهد.ناحيه 6'),
(1607, 16, 'مشهد -ناحيه 7'),
(1609, 16, 'احمدآباد'),
(1610, 16, 'تبادكان'),
(1611, 16, 'طرقبه'),
(1612, 16, 'فريمان'),
(1613, 16, 'كلات'),
(1614, 16, 'چناران'),
(1615, 16, 'خوشاب'),
(1616, 16, 'سرخس'),
(1617, 16, 'منطقه_اداره کل استثنایی استان خراسان رضوی'),
(1632, 16, 'رضويه'),
(1637, 16, 'تايباد'),
(1639, 16, 'تربت جام'),
(1641, 16, 'صالح آباد'),
(1643, 16, 'تربت حيدريه'),
(1644, 16, 'زاوه'),
(1645, 16, 'رشتخوار'),
(1646, 16, 'گل بهار'),
(1647, 16, 'ميان جلگه'),
(1649, 16, 'خواف'),
(1651, 16, 'درگز'),
(1653, 16, 'نوخندان'),
(1655, 16, 'سبزوار'),
(1656, 16, 'ششتمد'),
(1657, 16, 'زبرخان'),
(1659, 16, 'جغتاى'),
(1662, 16, 'جوين'),
(1664, 16, 'تحت جلگه'),
(1666, 16, 'باخرز'),
(1670, 16, 'قوچان'),
(1671, 16, 'داورزن'),
(1673, 16, 'كاشمر'),
(1675, 16, 'كوهسرخ'),
(1676, 16, 'بردسكن'),
(1678, 16, 'گناباد'),
(1680, 16, 'بجستان'),
(1689, 16, 'جلگه رخ'),
(1690, 16, 'نيشابور'),
(1692, 16, 'سرولايت'),
(1694, 16, 'مه ولات'),
(1697, 16, 'كدكن'),
(1698, 16, 'خليل آباد'),
(1700, 17, 'اداره کل '),
(1701, 17, 'اصفهان .ناحيه 1'),
(1702, 17, 'اصفهان .ناحيه 2'),
(1703, 17, 'اصفهان .ناحيه 3'),
(1704, 17, 'اصفهان .ناحيه 4'),
(1705, 17, 'اداره  ناحیه 5'),
(1713, 17, 'جرقویه سفلی'),
(1714, 17, 'منطقه_اداره کل استثنایی اصفهان '),
(1715, 17, 'کوهپايه '),
(1717, 17, 'جرقویه علیا'),
(1720, 17, 'شاهين شهر'),
(1722, 17, ' ميمه '),
(1724, 17, 'برخوار'),
(1726, 17, 'اردستان '),
(1728, 17, 'زرين شهر'),
(1729, 17, 'فولاد شهر'),
(1730, 17, ' ناحیه 6(جی)'),
(1731, 17, 'مبارکه '),
(1733, 17, ' باغبهادران'),
(1735, 17, ' شهرضا'),
(1737, 17, ' دهاقان '),
(1739, 17, 'فريدن '),
(1741, 17, 'چادگان '),
(1743, 17, 'بوئين مياندشت '),
(1745, 17, 'فلاورجان '),
(1746, 17, 'فريدون  شهر'),
(1748, 17, 'سميرم '),
(1750, 17, 'خوانسار'),
(1753, 17, 'گلپايگان '),
(1756, 17, ' نایین '),
(1759, 17, 'خوروبيابانک '),
(1761, 17, 'نجف آباد'),
(1764, 17, 'تیران وکرون'),
(1766, 17, 'خميني شهر'),
(1769, 17, 'کاشان'),
(1773, 17, 'آران وبيدگل '),
(1774, 17, 'پيربکران '),
(1775, 17, 'مهردشت '),
(1779, 17, 'نطنز'),
(1781, 17, 'جلگه '),
(1783, 17, 'بن رود'),
(1785, 17, 'زواره '),
(1787, 17, 'امامزاده '),
(1800, 18, 'تبريز.اداره كل'),
(1801, 18, 'تبريز.ناحيه 1'),
(1802, 18, 'تبريز.ناحيه 2'),
(1803, 18, 'تبريز.ناحيه 3'),
(1804, 18, 'تبريز.ناحيه 4'),
(1805, 18, 'تبريز -ناحيه 5'),
(1810, 18, 'اسكو'),
(1813, 18, 'آذرشهر'),
(1815, 18, 'بستان آباد'),
(1817, 18, 'شبستر'),
(1818, 18, 'صوفيان'),
(1820, 18, 'هريس'),
(1821, 18, 'مهربان'),
(1823, 18, 'خواجه'),
(1825, 18, 'خسروشهر'),
(1827, 18, 'گوگان'),
(1832, 18, 'اهر'),
(1833, 18, 'هوراند'),
(1835, 18, 'ورزقان'),
(1836, 18, 'خاروانا'),
(1837, 18, 'خداآفرين'),
(1838, 18, 'كاغذكنان'),
(1839, 18, 'كليبر'),
(1854, 18, 'سراب'),
(1857, 18, 'مراغه'),
(1859, 18, 'عجب شير'),
(1861, 18, 'بناب'),
(1863, 18, 'ملكان'),
(1865, 18, 'مرند'),
(1867, 18, 'جلفا'),
(1869, 18, 'تسوج'),
(1877, 18, 'ميانه'),
(1878, 18, 'كندوان'),
(1879, 18, 'تركمانچاى'),
(1884, 18, 'هشترود'),
(1887, 18, 'چاراويماق'),
(1889, 18, 'عشايرى'),
(1891, 18, 'تيكمه داش'),
(1893, 18, 'نظركهريز'),
(1895, 18, 'ايلخچي'),
(1896, 18, 'منطقه_اداره کل استثنایی آذربایجان شرقی '),
(1900, 19, 'اردبيل .اداره كل'),
(1901, 19, 'اردبيل ناحيه 1'),
(1902, 19, 'اردبيل ناحيه 2'),
(1903, 19, 'منطقه_اداره کل استثنایی اردبیل '),
(1911, 19, 'نير'),
(1914, 19, 'نمين'),
(1917, 19, 'خلخال'),
(1920, 19, 'خورش رستم'),
(1923, 19, 'شاهرود'),
(1926, 19, 'کوثر'),
(1929, 19, 'مغان (گرمي )'),
(1932, 19, 'پارس آباد'),
(1935, 19, 'بيله سوار'),
(1936, 19, 'اصلان دوز'),
(1938, 19, 'مشكين شهر'),
(1940, 19, 'هير'),
(1942, 19, 'انگوت'),
(1945, 19, 'ارشق'),
(1947, 19, 'قشلاق دشت'),
(1949, 19, 'سرعين'),
(1951, 19, 'مشكين شرقي (لاهرود )'),
(2000, 20, 'سارى .اداره كل'),
(2001, 20, 'سارى .ناحيه 1'),
(2002, 20, 'سارى .ناحيه 2'),
(2008, 20, 'دودانگه'),
(2010, 20, 'مياندرود'),
(2011, 20, 'چهاردانگه'),
(2013, 20, 'آمل'),
(2017, 20, 'لاريجان'),
(2020, 20, 'محمود آباد'),
(2022, 20, 'بابل'),
(2024, 20, 'بندپي شرقي'),
(2025, 20, 'بندپي غربي'),
(2026, 20, 'بابلسر'),
(2027, 20, 'بهنمير'),
(2028, 20, 'فريدون كنار'),
(2030, 20, 'بهشهر'),
(2032, 20, 'گلوگاه'),
(2035, 20, 'نکاء'),
(2037, 20, 'قائم شهر'),
(2038, 20, 'كياكلا'),
(2039, 20, 'جويبار'),
(2041, 20, 'تنكابن'),
(2042, 20, 'عباس آباد'),
(2045, 20, 'رامسر'),
(2051, 20, 'سوادكوه'),
(2052, 20, 'شيرگاه'),
(2070, 20, 'نور'),
(2071, 20, 'كجور'),
(2072, 20, 'چمستان'),
(2074, 20, 'بلده'),
(2080, 20, 'مرزن آباد'),
(2082, 20, 'نوشهر'),
(2093, 20, 'چالوس'),
(2096, 20, 'كلاردشت'),
(2097, 20, 'منطقه_اداره کل استثنایی مازندران '),
(2100, 21, 'سازمان خراسان شمالي'),
(2101, 21, 'بجنورد'),
(2118, 21, 'اسفراين'),
(2122, 21, 'جاجرم'),
(2123, 21, 'گرمه'),
(2124, 21, 'رازوجرگلان'),
(2126, 21, 'مانه وسملقان'),
(2128, 21, 'بام وصفي آباد'),
(2161, 21, 'شيروان'),
(2187, 21, 'فاروج'),
(2190, 21, 'منطقه_اداره آموزش و پرورش استثنایی شهر خراسان شمال'),
(2200, 22, 'سازمان خراسان جنوبي'),
(2201, 22, 'بيرجند'),
(2221, 22, 'سربيشه'),
(2230, 22, 'درميان'),
(2235, 22, 'نهبندان'),
(2242, 22, 'زيركوه حاجي آباد'),
(2263, 22, 'فردوس'),
(2265, 22, 'بشرويه'),
(2268, 22, 'سرايان'),
(2288, 22, 'قائنات'),
(2291, 22, 'خوسف'),
(2292, 22, 'طبس'),
(2293, 22, 'دستگردان'),
(2294, 22, 'منطقه_اداره آموزش و پرورش استثنایی شهر خراسان جنوب'),
(2300, 23, 'شيراز.اداره كل'),
(2301, 23, 'شيراز.ناحيه 1'),
(2302, 23, 'شيراز.ناحيه 2'),
(2303, 23, 'شيراز.ناحيه 3'),
(2304, 23, 'شيراز.ناحيه 4'),
(2305, 23, 'منطقه_اداره کل استثنایی فارس '),
(2310, 23, 'دشمن زيارى'),
(2311, 23, 'خرامه'),
(2313, 23, 'زرقان'),
(2314, 23, 'سروستان'),
(2316, 23, 'كوار'),
(2318, 23, 'ارژن (کوهمره  سرخي )'),
(2320, 23, 'آباده'),
(2321, 23, 'خرم  بيد'),
(2322, 23, 'بوانات'),
(2324, 23, 'سرچهان'),
(2325, 23, 'اقليد'),
(2326, 23, 'سده'),
(2327, 23, 'استهبان'),
(2330, 23, 'جهرم'),
(2331, 23, 'خفر'),
(2333, 23, 'داراب'),
(2335, 23, 'زرين  دشت'),
(2337, 23, 'سپيدان'),
(2339, 23, 'بيضا'),
(2341, 23, 'فسا'),
(2342, 23, 'ششده وقره بلاغ'),
(2343, 23, 'شيب كوه'),
(2345, 23, 'فيروزآباد'),
(2346, 23, 'فراشبند'),
(2348, 23, 'قيروكارزين'),
(2350, 23, 'كازرون'),
(2351, 23, 'بالاده'),
(2352, 23, 'خشت وكمارج'),
(2354, 23, 'کهمره'),
(2356, 23, 'قايميه'),
(2358, 23, 'گله دار'),
(2360, 23, 'لارستان'),
(2361, 23, 'بيرم'),
(2362, 23, 'جويم'),
(2364, 23, 'گراش'),
(2366, 23, 'اوز'),
(2367, 23, 'خنج'),
(2368, 23, 'لامرد'),
(2369, 23, 'مهر'),
(2370, 23, 'مرودشت'),
(2371, 23, 'كامفيروز'),
(2372, 23, 'ارسنجان'),
(2374, 23, 'پاسارگاد'),
(2376, 23, 'درودزن'),
(2380, 23, 'ممسني'),
(2381, 23, 'رستم'),
(2382, 23, 'ماهورميلاتي'),
(2384, 23, 'اشكنان'),
(2386, 23, 'علامرودشت'),
(2390, 23, 'ني ريز'),
(2391, 23, 'عشايري  فارس'),
(2392, 23, 'آباده  طشک'),
(2394, 23, 'فرگ'),
(2396, 23, 'ميمند'),
(2397, 23, 'مشهدمرغاب (قادرآباد )'),
(2400, 24, 'اداره كل آموزش وپرورش استان البرز'),
(2401, 24, 'كرج ناحيه 1'),
(2402, 24, 'كرج ناحيه 2'),
(2403, 24, 'كرج ناحيه 3'),
(2404, 24, 'کرج ناحیه 4'),
(2421, 24, 'ساوجبلاغ'),
(2422, 24, 'طالقان'),
(2423, 24, 'نظرآباد'),
(2424, 24, 'اشتهارد'),
(2430, 24, 'منطقه_اداره آموزش و پرورش استثنایی شهر البرز'),
(2500, 25, 'قم .اداره كل'),
(2531, 25, 'قم .ناحيه 1'),
(2532, 25, 'قم .ناحيه 2'),
(2534, 25, 'قم .ناحيه 3'),
(2535, 25, 'خلجستان'),
(2537, 25, 'كهك'),
(2538, 25, 'جعفرآباد'),
(2540, 25, 'قم ناحيه 4'),
(2550, 25, 'منطقه_اداره کل استثنایی قم'),
(2700, 27, 'اداره كل گلستان'),
(2747, 27, 'بندرتركمن'),
(2749, 27, 'گميشان'),
(2753, 27, 'علي آباد'),
(2755, 27, 'كردكوى'),
(2757, 27, 'بندرگز'),
(2759, 27, 'گنبدكاووس'),
(2761, 27, 'راميان'),
(2763, 27, 'مينودشت'),
(2764, 27, 'گاليكش'),
(2765, 27, 'مراوه تپه'),
(2767, 27, 'كلاله'),
(2775, 27, 'گرگان'),
(2779, 27, 'آق قلا'),
(2780, 27, 'منطقه_اداره کل استثنایی گلستان'),
(2794, 27, 'آزادشهر'),
(2900, 29, 'اروميه .اداره كل'),
(2901, 29, 'اروميه .ناحيه 1'),
(2902, 29, 'اروميه .ناحيه 2'),
(2903, 29, 'منطقه_اداره کل استثنایی آذربایجان غربی '),
(2909, 29, 'انزل'),
(2910, 29, 'خوى'),
(2913, 29, 'چايپاره'),
(2916, 29, 'ماكو'),
(2918, 29, 'شوط'),
(2920, 29, 'پلدشت'),
(2922, 29, 'چالدران'),
(2925, 29, 'سلماس'),
(2927, 29, 'مهاباد'),
(2929, 29, 'بوكان'),
(2931, 29, 'مياندوآب'),
(2933, 29, 'شاهین دژ'),
(2935, 29, 'تكاب'),
(2937, 29, 'پيران  شهر'),
(2940, 29, 'سردشت'),
(2943, 29, 'نقده'),
(2946, 29, 'اشنويه'),
(2948, 29, 'سيلوانا'),
(2950, 29, 'مرحمت آباد'),
(2952, 29, 'كشاورز'),
(2954, 29, 'صوماى برادوست'),
(2957, 29, 'نازلو'),
(3100, 31, 'شهركرد.اداره كل'),
(3101, 31, 'شهر کرد ناحیه 1'),
(3102, 31, 'شهر کرد ناحیه 2'),
(3103, 31, 'منطقه_اداره کل استثنایی چهارمحال وبختیاری '),
(3104, 31, 'كيار'),
(3107, 31, 'بروجن'),
(3109, 31, 'اردل'),
(3112, 31, 'فارسان'),
(3115, 31, 'کوهرنگ'),
(3118, 31, 'لردگان'),
(3119, 31, 'فلارد'),
(3122, 31, 'لاران'),
(3124, 31, 'سامان'),
(3126, 31, 'بن'),
(3127, 31, 'میانکوه'),
(3129, 31, 'گندمان'),
(3131, 31, 'خانمیرزا'),
(3133, 31, 'بلداجی'),
(3144, 31, 'عشایری چهارمحال و بختیاری'),
(3400, 34, 'ايلام .اداره كل'),
(3401, 34, 'ايلام'),
(3402, 34, 'منطقه_اداره کل استثنایی ایلام '),
(3403, 34, 'ايوان'),
(3406, 34, 'دره شهر'),
(3412, 34, 'آبدانان'),
(3416, 34, 'دهلران'),
(3419, 34, 'چرداول'),
(3423, 34, 'شيروان'),
(3426, 34, 'مهران'),
(3430, 34, 'ملكشاهي'),
(3432, 34, 'بدره'),
(3450, 34, 'چوار'),
(3452, 34, 'زرين آباد'),
(3454, 34, 'هليلان'),
(3456, 34, 'موسيان'),
(3500, 35, 'كرمانشاه .اداره كل'),
(3501, 35, 'كرمانشاه .ناحيه 1'),
(3502, 35, 'كرمانشاه .ناحيه 2'),
(3503, 35, 'كرمانشاه .ناحيه 3'),
(3504, 35, 'منطقه_اداره کل استثنایی کرمانشاه '),
(3506, 35, 'صحنه'),
(3509, 35, 'هرسين'),
(3511, 35, 'كنگاور'),
(3514, 35, 'قصرشيرين'),
(3517, 35, 'سرپل ذهاب'),
(3520, 35, 'پاوه'),
(3524, 35, 'نوسود'),
(3527, 35, 'سنقرکليايي'),
(3530, 35, 'جوانرود'),
(3533, 35, 'روانسر'),
(3535, 35, 'ثلاث باباجاني'),
(3537, 35, 'اسلام آباد'),
(3538, 35, 'ماهيدشت'),
(3540, 35, 'کرندغرب'),
(3545, 35, 'گيلانغرب'),
(3546, 35, 'باينگان'),
(3548, 35, 'دينور'),
(3550, 35, 'حميل'),
(3552, 35, 'گهواره'),
(3554, 35, 'بيستون'),
(3556, 35, 'گواور'),
(3590, 35, 'اداره کل استثنایی استان کرمانشاه'),
(3600, 36, 'اهواز.اداره كل'),
(3601, 36, 'اهواز.ناحيه 1'),
(3602, 36, 'اهواز.ناحيه 2'),
(3603, 36, 'اهواز.ناحيه 3'),
(3604, 36, 'اهواز.ناحيه 4'),
(3605, 36, 'منطقه_اداره کل استثنایی استان خوزستان '),
(3606, 36, 'كارون'),
(3608, 36, 'باوى'),
(3609, 36, 'آبادان'),
(3613, 36, 'اروندكنار'),
(3616, 36, 'ايذه'),
(3617, 36, 'دهدز'),
(3619, 36, 'باغملك جانكي'),
(3620, 36, 'صيدون'),
(3622, 36, 'بهبهان'),
(3624, 36, 'زيدون'),
(3625, 36, 'آغاجارى'),
(3627, 36, 'خرمشهر'),
(3630, 36, 'دزفول'),
(3633, 36, 'شوش'),
(3636, 36, 'انديمشك'),
(3639, 36, 'دشت آزادگان'),
(3642, 36, 'بستان'),
(3645, 36, 'هويزه'),
(3649, 36, 'رامهرمز'),
(3651, 36, 'رامشير'),
(3654, 36, 'شادگان'),
(3657, 36, 'ماهشهر'),
(3660, 36, 'بندرامام خميني'),
(3663, 36, 'هنديجان'),
(3665, 36, 'مسجدسليمان'),
(3668, 36, 'لالي'),
(3670, 36, 'هفتگل'),
(3673, 36, 'شوشتر'),
(3676, 36, 'گتوند'),
(3677, 36, 'اميديه'),
(3678, 36, 'انديكا'),
(3680, 36, 'سردشت'),
(3688, 36, 'عشايرى'),
(3690, 36, 'الوارگرم سيرى'),
(3692, 36, 'شاوور'),
(3694, 36, 'حميديه'),
(3700, 37, 'رشت 0اداره كل'),
(3701, 37, 'رشت .ناحيه 1'),
(3702, 37, 'رشت .ناحيه 2'),
(3706, 37, 'خمام'),
(3707, 37, 'خشكبيجار'),
(3708, 37, 'كوچصفهان'),
(3711, 37, 'لشت  نشاء'),
(3713, 37, 'سنگر'),
(3716, 37, 'بندرانزلي'),
(3719, 37, 'لاهيجان'),
(3722, 37, 'سياهكل'),
(3724, 37, 'ديلمان'),
(3725, 37, 'رودسر'),
(3727, 37, 'كلاچاى'),
(3728, 37, 'املش'),
(3730, 37, 'رحيم آباد'),
(3733, 37, 'تالش'),
(3735, 37, 'رضوانشهر'),
(3737, 37, 'ماسال وشاندرمن'),
(3740, 37, 'فومن'),
(3742, 37, 'شفت'),
(3745, 37, 'صومعه سرا'),
(3747, 37, 'تولمات'),
(3750, 37, 'آستانه اشرفيه'),
(3753, 37, 'بندركياشهر'),
(3756, 37, 'لنگرود'),
(3759, 37, 'رودبار'),
(3761, 37, 'عمارلو'),
(3764, 37, 'آستارا'),
(3766, 37, 'كومله'),
(3768, 37, 'رحمت آبادوبلوكات'),
(3770, 37, 'اطاقور'),
(3772, 37, 'رودبنه'),
(3774, 37, 'چابكسر'),
(3775, 37, 'حويق'),
(3776, 37, 'منطقه_اداره کل استثنایی گیلان '),
(3800, 38, 'كرمان .اداره كل'),
(3801, 38, 'كرمان .ناحيه 1'),
(3802, 38, 'كرمان .ناحيه 2'),
(3803, 38, 'منطقه_اداره کل استثنایی کرمان '),
(3807, 38, 'رودبار'),
(3808, 38, 'راور'),
(3810, 38, 'شهداد'),
(3813, 38, 'گلباف'),
(3815, 38, 'ماهان'),
(3818, 38, 'جيرفت'),
(3820, 38, 'كشكوئيه'),
(3821, 38, 'رفسنجان'),
(3822, 38, 'انار'),
(3823, 38, 'بم'),
(3826, 38, 'راين'),
(3829, 38, 'نرماشير'),
(3831, 38, 'سيرجان'),
(3833, 38, 'بردسير'),
(3836, 38, 'شهربابك'),
(3839, 38, 'بافت'),
(3841, 38, 'ارزوئيه'),
(3844, 38, 'رابر'),
(3845, 38, 'فارياب'),
(3846, 38, 'كهنوج'),
(3847, 38, 'ريگان'),
(3849, 38, 'منوجان'),
(3851, 38, 'قلعه گنج'),
(3853, 38, 'زرند'),
(3856, 38, 'كوهبنان'),
(3859, 38, 'عنبرآباد'),
(3861, 38, 'چترود'),
(3863, 38, 'فهرج'),
(3865, 38, 'نوق'),
(3877, 38, 'عشايرى'),
(4200, 42, 'ياسوج .اداره كل'),
(4201, 42, 'منطقه_اداره کل استثنایی کهکیلویه وبویراحمد'),
(4259, 42, 'ياسوج'),
(4261, 42, 'دنا'),
(4263, 42, 'دهدشت (كهكيلويه )'),
(4264, 42, 'لنده'),
(4266, 42, 'چرام'),
(4269, 42, 'بهمئي'),
(4271, 42, 'گچساران'),
(4275, 42, 'باشت'),
(4277, 42, 'چاروسا'),
(4278, 42, 'مارگون'),
(4280, 42, 'لوداب'),
(4282, 42, 'ديشموك'),
(4288, 42, 'عشايرى'),
(4400, 44, 'يزد.اداره كل'),
(4401, 44, 'يزد.ناحيه 1'),
(4402, 44, 'يزد.ناحيه 2'),
(4403, 44, 'منطقه_اداره کل استثنایی یزد'),
(4404, 44, 'صدوق'),
(4406, 44, 'اردكان'),
(4409, 44, 'ميبد'),
(4412, 44, 'بافق'),
(4413, 44, 'بهاباد'),
(4415, 44, 'تفت'),
(4416, 44, 'نير'),
(4417, 44, 'ابركوه'),
(4420, 44, 'مهريز'),
(4421, 44, 'خاتم'),
(4427, 44, 'زارچ'),
(4429, 44, 'مروست'),
(4600, 46, 'اداره كل استان قزوين'),
(4617, 46, 'تاكستان'),
(4620, 46, 'ضياء آباد'),
(4628, 46, 'قزوين ناحيه 1'),
(4629, 46, 'قزوين ناحيه 2'),
(4630, 46, 'آبيك'),
(4633, 46, 'آوج'),
(4636, 46, 'بوئين زهرا'),
(4639, 46, 'رودبارالموت'),
(4640, 46, 'رودبارشهرستان'),
(4641, 46, 'طارم سفلي'),
(4643, 46, 'خرمدشت'),
(4645, 46, 'البرز'),
(4647, 46, 'اسفرورين'),
(4649, 46, 'شال'),
(4650, 46, 'منطقه_اداره کل استثنایی قزوین '),
(4900, 49, 'زاهدان .اداره كل'),
(4901, 49, 'زاهدان .ناحيه 1'),
(4902, 49, 'زاهدان .ناحيه 2'),
(4904, 49, 'زابل'),
(4907, 49, 'پشت  آب'),
(4908, 49, 'بنجار'),
(4909, 49, 'اداره آموزش و پرورش پلان'),
(4910, 49, 'شيب آب'),
(4913, 49, 'زهك'),
(4916, 49, 'هيرمند'),
(4919, 49, 'ايرانشهر'),
(4922, 49, 'بمپور'),
(4923, 49, 'لاشار'),
(4924, 49, 'فنوج'),
(4925, 49, 'بزمان'),
(4927, 49, 'سرباز'),
(4928, 49, 'راسك'),
(4930, 49, 'نيك شهر'),
(4933, 49, 'قصرقند'),
(4936, 49, 'چا بهار'),
(4937, 49, 'كنارك'),
(4939, 49, 'خاش'),
(4941, 49, 'سراوان'),
(4943, 49, 'سيب وسوران'),
(4945, 49, 'زابلي'),
(4946, 49, 'دشتيارى'),
(4948, 49, 'ميرجاوه'),
(4950, 49, 'نصرت آباد'),
(4952, 49, 'جالق'),
(4954, 49, 'نوك آباد'),
(4956, 49, 'دلگان'),
(4958, 49, 'بنت'),
(4960, 49, 'بم پشت'),
(4977, 49, 'عشايرى سيستان بلوچستان'),
(4978, 49, 'منطقه_اداره کل استثنایی سیستان وبلوچستان '),
(5000, 50, 'بندرعباس .اداره كل'),
(5001, 50, 'بندرعباس .ناحيه 1'),
(5002, 50, 'بندرعباس .ناحيه 2'),
(5004, 50, 'خمير'),
(5006, 50, 'فين وسياهو'),
(5009, 50, 'حاجي آباد'),
(5011, 50, 'جاسك'),
(5013, 50, 'شيب كوه'),
(5014, 50, 'بندرلنگه'),
(5015, 50, 'منطقه_اداره کل استثنایی هرمزگان '),
(5016, 50, 'بستك'),
(5019, 50, 'پارسیان'),
(5022, 50, 'قشم'),
(5024, 50, 'بيابان سيريک'),
(5025, 50, 'ميناب'),
(5026, 50, 'بشاگرد'),
(5028, 50, 'رودان'),
(5029, 50, 'رودخانه'),
(5032, 50, 'كيش'),
(5034, 50, 'ابوموسي'),
(5036, 50, 'سندرك'),
(5038, 50, 'شهاب'),
(5040, 50, 'هرمز'),
(5041, 50, 'جناح'),
(5042, 50, 'لیردف'),
(5100, 51, 'بوشهر.اداره كل'),
(5101, 51, 'بوشهر'),
(5102, 51, 'منطقه_اداره کل استثنایی بوشهر'),
(5104, 51, 'خارك'),
(5106, 51, 'گناوه'),
(5107, 51, 'كاكي'),
(5109, 51, 'ريگ'),
(5112, 51, 'ديلم'),
(5116, 51, 'دشتستان (برازجان )'),
(5119, 51, 'سعدآباد'),
(5122, 51, 'شبانكاره'),
(5125, 51, 'تنگستان (اهرم )'),
(5128, 51, 'ساحلي (دلوار )'),
(5131, 51, 'دشتي (خورموج )'),
(5132, 51, 'آب بخش'),
(5134, 51, 'كنگان'),
(5135, 51, 'جم وريز'),
(5137, 51, 'دير'),
(5139, 51, 'بردخون'),
(5141, 51, 'عسلويه'),
(5400, 54, 'خرم آباد.اداره كل'),
(5401, 54, 'خرم آباد.ناحيه 1'),
(5402, 54, 'خرم آباد.ناحيه 2'),
(5405, 54, 'پاپي (راه آهن )'),
(5407, 54, 'الشتر'),
(5409, 54, 'چگني'),
(5410, 54, 'منطقه_اداره کل استثنایی لرستان '),
(5411, 54, 'زاغه'),
(5413, 54, 'پل دختر'),
(5415, 54, 'ويسيان'),
(5417, 54, 'دلفان'),
(5420, 54, 'كوهدشت'),
(5421, 54, 'طرحان'),
(5423, 54, 'اليگودرز'),
(5426, 54, 'ازنا'),
(5429, 54, 'بروجرد'),
(5432, 54, 'اشترينان'),
(5435, 54, 'دورود'),
(5437, 54, 'سيلاخور'),
(5438, 54, 'رومشگان'),
(5439, 54, 'چغلوندى'),
(5441, 54, 'معمولان'),
(5443, 54, 'ززوماهرو'),
(5445, 54, 'كوهناني'),
(5447, 54, 'كاكاوند'),
(5488, 54, 'عشايرى لرستان'),
(5500, 55, 'همدان .اداره كل'),
(5501, 55, 'همدان .ناحيه 1'),
(5502, 55, 'همدان .ناحيه 2'),
(5503, 55, 'اسدآباد'),
(5504, 55, 'منطقه_اداره کل استثنایی همدان '),
(5506, 55, 'فامنين'),
(5508, 55, 'قهاوند شرا'),
(5511, 55, 'رزن'),
(5512, 55, 'سردرود'),
(5514, 55, 'بهار'),
(5517, 55, 'کبودرآهنگ'),
(5520, 55, 'ملاير'),
(5523, 55, 'سامن'),
(5525, 55, 'تويسركان'),
(5528, 55, 'نهاوند'),
(5533, 55, 'خزل'),
(5536, 55, 'جوكار'),
(5538, 55, 'گل تپه'),
(5540, 55, 'قروه درجزين'),
(5542, 55, 'قلقل رود(فرسفج )'),
(5544, 55, 'لالجين'),
(5700, 57, 'زنجان .اداره كل'),
(5701, 57, 'زنجان .ناحيه 1'),
(5702, 57, 'زنجان .ناحيه 2'),
(5703, 57, 'منطقه_اداره کل استثنایی زنجان '),
(5705, 57, 'طارم'),
(5708, 57, 'ماه نشان'),
(5711, 57, 'ابهر'),
(5712, 57, 'خرمدره'),
(5714, 57, 'سلطانيه'),
(5723, 57, 'خدابنده'),
(5725, 57, 'افشار'),
(5731, 57, 'زنجانرود'),
(5734, 57, 'ایجرود'),
(5743, 57, 'بزينه رود'),
(5745, 57, 'انگوران'),
(5747, 57, 'سجاسرود'),
(5800, 58, 'سنندج .اداره كل'),
(5801, 58, 'سنندج .ناحيه 1'),
(5802, 58, 'سنندج .ناحيه 2'),
(5803, 58, 'منطقه_اداره کل استثنایی کردستان '),
(5805, 58, 'ديواندره'),
(5808, 58, 'كامياران'),
(5811, 58, 'بانه'),
(5815, 58, 'بيجار'),
(5818, 58, 'سقز'),
(5820, 58, 'قروه'),
(5823, 58, 'دهگلان'),
(5825, 58, 'مريوان'),
(5829, 58, 'سروآباد'),
(5830, 58, 'كراني'),
(5832, 58, 'موچش'),
(5834, 58, 'زيويه'),
(5836, 58, 'كلاترزان'),
(5838, 58, 'سريش آباد'),
(6000, 60, 'سمنان .اداره كل'),
(6001, 60, 'سمنان'),
(6002, 60, 'منطقه_اداره کل استثنایی سمنان '),
(6006, 60, 'مهدي شهر'),
(6009, 60, 'شاهرود'),
(6011, 60, 'بسطام'),
(6015, 60, 'ميامي'),
(6018, 60, 'دامغان'),
(6022, 60, 'اميرآباد'),
(6026, 60, 'گرمسار'),
(6027, 60, 'بيارجمند'),
(6029, 60, 'سرخه'),
(6030, 60, 'آرادان'),
(6099, 60, 'نامشخص'),
(6100, 61, ''),
(9400, 94, '*****کل مدارس خارج کشور'),
(9401, 94, 'مدارس تطبيقي وبين الملل'),
(9410, 94, 'م.ج.ا.ا در کشور امارات '),
(9420, 94, 'م.ج.ا.ا در کشور کويت'),
(9423, 94, 'م.ج.ا.ا در اروپاوکانادا'),
(9427, 94, 'م.ج.ا.ا در کشور قطروبحرين'),
(9428, 94, 'م.ج.ا.ا در شبه قاره  هند'),
(9430, 94, 'م.ج.ا.ا در کشور سوريه ولبنان'),
(9432, 94, 'م.ج.ا.ا در کشور ترکيه'),
(9434, 94, 'سرپرستی مدارس جمهوری اسلامی ایران در کشورهای حوزه '),
(9436, 94, 'م.ج.ا.ا در آفريقاوخاورميانه'),
(9438, 94, 'م.ج.ا.ا در آسياي  شرقي  واستراليا'),
(9445, 94, 'بين الملل'),
(9500, 95, 'استعدادهای درخشان ستاد'),
(9600, 96, 'نهضت سواد آموزی'),
(9700, 97, 'سازمان استثنایی ستاد');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) NOT NULL,
  `national_id` varchar(10) COLLATE utf8mb4_persian_ci NOT NULL,
  `first_name` varchar(50) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `last_name` varchar(50) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `father_name` varchar(50) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `gender` tinyint(4) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `persian_birth_date` varchar(10) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `mobile` varchar(11) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `user_type` int(11) DEFAULT NULL,
  `verified` tinyint(1) DEFAULT NULL,
  `employee_key` char(36) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `personnel_code` int(11) DEFAULT NULL,
  `org_position_code` int(11) DEFAULT NULL,
  `org_position_desc` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `org_position_type_code` int(11) DEFAULT NULL,
  `org_position_type_desc` varchar(50) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `region_id` int(11) DEFAULT NULL,
  `regionName` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `is_foreigner` tinyint(1) DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL,
  `roles` varchar(200) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `education` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `yearsOfService` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `national_id`, `first_name`, `last_name`, `father_name`, `gender`, `birth_date`, `persian_birth_date`, `mobile`, `user_type`, `verified`, `employee_key`, `personnel_code`, `org_position_code`, `org_position_desc`, `org_position_type_code`, `org_position_type_desc`, `region_id`, `regionName`, `is_foreigner`, `ip_address`, `created_at`, `updated_at`, `roles`, `education`, `yearsOfService`) VALUES
(4, '0534921973', 'ميلاد', 'فراهاني', 'صفرعلي', 1, '1987-01-26', '1365/11/06', '09186283451', 3, 0, 'f904d5ac-41b0-4841-b9a7-a38a44febf32', 96304232, 10000541, 'کارشناس بهبودکیفیت و توسعه برنامه های آموزشی نوین وهوشمند سازی مدارس', 4, 'کارشناس', 1000, 'منطقه 14', 0, '2.178.5.142', '2026-02-05 17:23:14', '2026-02-24 16:25:18', 'CANDIDATE', 'لیسانس', 15),
(6, '4269875895', 'اعظم', 'امینی', 'حیدر', 1, '1987-01-26', '1365/11/06', '09186283451', 3, 0, 'f904d5ac-41b0-4841-b9a7-a38a44febf32', 96304232, 10000541, 'کارشناس متوسطه', 4, 'کارشناس', 1000, 'منطقه 14', 0, '2.178.33.68', '2026-02-05 17:23:14', '2026-02-21 13:12:41', 'VOTER', 'لیسانس', 15),
(7, '4269930977', 'صابر', 'اسدی', 'حیدر', 1, '1987-01-26', '1365/11/06', '09186283451', 3, 0, 'f904d5ac-41b0-4841-b9a7-a38a44febf32', 96304232, 10000541, 'معاون فناوری', 4, 'کارشناس', 1000, 'منطقه 14', 0, '2.178.33.68', '2026-02-05 17:23:14', '2026-02-21 13:12:41', 'SUPERVISOR', 'لیسانس', 15);

-- --------------------------------------------------------

--
-- Table structure for table `userstatus`
--

CREATE TABLE `userstatus` (
  `user_id` bigint(20) NOT NULL,
  `nationalId` varchar(20) NOT NULL,
  `ozvsandogh` tinyint(1) DEFAULT NULL,
  `sabegheO` tinyint(1) DEFAULT NULL,
  `madrak` tinyint(1) DEFAULT NULL,
  `create_date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `userstatus`
--

INSERT INTO `userstatus` (`user_id`, `nationalId`, `ozvsandogh`, `sabegheO`, `madrak`, `create_date`) VALUES
(2, '0534921972', 1, 1, 1, '2026-02-05 22:42:42'),
(4, '0534921973', 1, 1, 1, '2026-02-06 00:52:33');

-- --------------------------------------------------------

--
-- Table structure for table `user_addresses`
--

CREATE TABLE `user_addresses` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) NOT NULL,
  `post_code` varchar(10) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `address` text COLLATE utf8mb4_persian_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `user_addresses`
--

INSERT INTO `user_addresses` (`id`, `user_id`, `post_code`, `address`) VALUES
(2, 4, '1764973127', 'استان تهران،شهر تهران،شیوا،خیابان ش حجت الاسلام مهدی شاه آبادی،کوچه اعتصامی، کد پستی ١٧٦٤٩٧٣١٢٧');

-- --------------------------------------------------------

--
-- Table structure for table `user_documents`
--

CREATE TABLE `user_documents` (
  `id` int(11) NOT NULL,
  `nationalId` varchar(20) DEFAULT NULL,
  `user_photo` varchar(255) NOT NULL,
  `education_doc` varchar(255) NOT NULL,
  `employment_cert` varchar(255) NOT NULL,
  `soPishine_cert` varchar(255) DEFAULT NULL,
  `ravan_cert` varchar(255) DEFAULT NULL,
  `supervision_status` varchar(50) DEFAULT NULL,
  `supervision_reason` text DEFAULT NULL,
  `supervision_reviewed_by` varchar(20) DEFAULT NULL,
  `supervision_reviewed_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `document_reviews` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`document_reviews`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user_documents`
--

INSERT INTO `user_documents` (`id`, `nationalId`, `user_photo`, `education_doc`, `employment_cert`, `soPishine_cert`, `ravan_cert`, `supervision_status`, `supervision_reason`, `supervision_reviewed_by`, `supervision_reviewed_at`, `created_at`, `updated_at`, `document_reviews`) VALUES
(7, '4269875895', 'uploads/user_documents/nid_0534921973/user_photo_20260221_2047_e5411daf.png', '', 'uploads/user_documents/nid_0534921973/employment_cert_20260215_1945_74399572.jpg', 'uploads/user_documents/nid_0534921973/soPishine_cert_20260221_2047_7728c92e.jpg', 'uploads/user_documents/nid_0534921973/ravan_cert_20260221_2047_6d71bded.png', 'SUPERVISION_REJECTED', '11', '0534921973', '2026-02-21 21:29:00', '2026-02-08 20:37:02', '2026-02-23 00:30:41', '{\"user_photo\": {\"status\": \"approved\", \"reviewed_by\": \"0534921973\", \"reviewed_at\": \"2026-02-21 21:28:54\"}, \"employment_cert\": {\"status\": \"approved\", \"reviewed_by\": \"0534921973\", \"reviewed_at\": \"2026-02-21 21:28:30\"}}'),
(19, '0534921973', 'uploads/user_documents/nid_0534921973/user_photo_20260223_0122_c48fde43.png', '', '', 'uploads/user_documents/nid_0534921973/soPishine_cert_20260223_0122_a513208a.jpg', 'uploads/user_documents/nid_0534921973/ravan_cert_20260223_0122_13ac6aeb.png', NULL, NULL, NULL, NULL, '2026-02-23 01:14:16', '2026-02-23 01:22:08', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `voters`
--

CREATE TABLE `voters` (
  `id` int(11) NOT NULL,
  `candidateId` bigint(20) NOT NULL,
  `createdate` timestamp NOT NULL DEFAULT current_timestamp(),
  `usernationalid` varchar(15) NOT NULL,
  `trackingCode` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `votes`
--

CREATE TABLE `votes` (
  `id` int(11) NOT NULL,
  `national_id` varchar(10) NOT NULL,
  `candidate_id` int(11) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `votes`
--

INSERT INTO `votes` (`id`, `national_id`, `candidate_id`, `created_at`) VALUES
(27, '0534921973', 2, '2026-02-09 01:12:46');

-- --------------------------------------------------------

--
-- Table structure for table `voting_tokens`
--

CREATE TABLE `voting_tokens` (
  `id` bigint(20) NOT NULL,
  `user_id` varchar(20) NOT NULL,
  `token_hash` varchar(255) NOT NULL,
  `expires_at` datetime NOT NULL,
  `used` tinyint(4) DEFAULT 0,
  `used_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `voting_tokens`
--

INSERT INTO `voting_tokens` (`id`, `user_id`, `token_hash`, `expires_at`, `used`, `used_at`, `created_at`) VALUES
(6, '0534921972', '3316377c35a02808ac40a1069b6e08861f48a9447282b9a6c5d675f11b654fcb', '2026-02-07 03:40:11', 1, '2026-02-07 03:38:11', '2026-02-07 03:38:11'),
(7, '0534921973', '53f16abb58131870d59555f3168deab3fafcd566f474f3bc1136d93f85f32506', '2026-02-08 22:25:28', 0, NULL, '2026-02-08 22:23:28'),
(8, '0534921973', 'fffe12c3c710edf3eb1a40c0caf0138c915be76a6fb234599b549245ece5cee3', '2026-02-08 22:25:34', 0, NULL, '2026-02-08 22:23:34'),
(9, '0534921973', 'fea80bd6bf5a8869afc0b5c36505a7385dd179bf469eafd125fba5071c6177da', '2026-02-08 22:27:17', 0, NULL, '2026-02-08 22:25:17'),
(10, '0534921973', '1fd80d33600b2f1094f41f0c16cf1879e27739e9e81852c80bff29de12bb84eb', '2026-02-08 22:31:26', 0, NULL, '2026-02-08 22:29:26'),
(11, '0534921973', '894ddc50157993acc4cf8a97a2900aae2c286eeee086909957ab3b21b10ff062', '2026-02-08 22:31:55', 0, NULL, '2026-02-08 22:29:55'),
(12, '0534921973', 'fe98d7d1013000d4643c30bb8dfe50bfe28b75e402dd3235c6ea53390d0acef3', '2026-02-08 22:32:23', 0, NULL, '2026-02-08 22:30:23'),
(13, '0534921973', '78d793e7c9caa1a1d58448d7f0d57aa51f908bf63c0795bf50ca9cd6bb26b6ba', '2026-02-08 22:32:53', 0, NULL, '2026-02-08 22:30:53'),
(14, '0534921973', '664eca2a8f22df1bdee9ea87c93934bbcdb167a476f0809730c3c538e98e7b5b', '2026-02-08 22:32:57', 0, NULL, '2026-02-08 22:30:57'),
(15, '0534921973', '101e74f14740d48e117b2791bdb2cacd2f484145e5799e18746eb23dc7c6c96b', '2026-02-08 22:33:18', 0, NULL, '2026-02-08 22:31:18'),
(16, '0534921973', '537bc230622861dc4788fe0c0d3b60db998644733a9b813aa7bfb3e62b04e16a', '2026-02-08 22:33:35', 0, NULL, '2026-02-08 22:31:35'),
(17, '0534921973', 'b94a374582c32a8991769e276cbb9217de06392ec4605ffc98a36a2cc7594279', '2026-02-08 22:33:38', 0, NULL, '2026-02-08 22:31:38'),
(18, '0534921973', '84222ecf6796e7487fb18ce8c5dcfa55b1fd60f665582f12c2749659a7054f62', '2026-02-08 22:37:20', 0, NULL, '2026-02-08 22:35:20'),
(19, '0534921973', '79a224326d91c61c58101d004bd1f1da94ed5cdc05e1fa61140cfa5d8451885f', '2026-02-08 22:37:23', 0, NULL, '2026-02-08 22:35:23'),
(20, '0534921973', '55a21fac44816cbd97eabf16a7c73b5ddc33fcf2ddb0b49a175f9d4884812082', '2026-02-08 22:47:38', 0, NULL, '2026-02-08 22:45:38'),
(21, '0534921973', 'f28936a8b25d9010b8aa53b0832cd3f9a00577c0d2f8ad0d1efde223b2812dfb', '2026-02-08 22:48:26', 0, NULL, '2026-02-08 22:46:26'),
(22, '0534921973', '4b0ce5111b5fdb166b2d5baa141b701aa1ba6c435eb1f45b77eca691fc1ef3f1', '2026-02-08 22:56:04', 0, NULL, '2026-02-08 22:54:04'),
(23, '0534921973', '61108420ba360d68507bee17c8772145502edb4fa1b5533ecb4927ef3d4b10ee', '2026-02-08 22:56:09', 0, NULL, '2026-02-08 22:54:09'),
(24, '0534921973', '7a3da6151231d735c4d6df6bb8622a08650de95bc6295bef7fb8bac47ef35970', '2026-02-08 22:58:57', 0, NULL, '2026-02-08 22:56:57'),
(25, '0534921973', 'a20be1401b4836d1f97eaf3cf085f27bd9eebf9e2dacd031fc726d9d54ef1cf8', '2026-02-08 22:59:35', 0, NULL, '2026-02-08 22:57:35'),
(26, '0534921973', '3de62117e09eab4d2c973ef34f1ebddc74a44c92da4c82e3ac5b25229ca2f320', '2026-02-08 22:59:39', 0, NULL, '2026-02-08 22:57:39'),
(27, '0534921973', '3901aa0dd6b010c7d69527c988110f76066ae951ec8ec365b0028f3cea2af51f', '2026-02-08 22:59:44', 0, NULL, '2026-02-08 22:57:44'),
(28, '0534921973', 'c84173d66a8291a161f685fb261af5513a1b275d43a59b466fcacbbf2f706365', '2026-02-08 23:00:43', 0, NULL, '2026-02-08 22:58:43'),
(29, '0534921973', '5197bf0ad32a3f508239eff3de83992452d51698d9191102385baca6ec35d842', '2026-02-08 23:03:29', 0, NULL, '2026-02-08 23:01:29'),
(30, '0534921973', '30c0c95d911d2ab85178e224ad20a9f19206289ac964d6a705ee71414728bc87', '2026-02-08 23:07:49', 0, NULL, '2026-02-08 23:05:49'),
(31, '0534921973', 'e37cce532962ed9ee299b0045a437cb1b7577c45f6976b268a2f274b30ec7a63', '2026-02-08 23:07:53', 0, NULL, '2026-02-08 23:05:53'),
(32, '0534921973', '4a6d076391409a294016e78412dd98ffee885a85e404d7e0aeb609ebd8f5a295', '2026-02-08 23:17:24', 0, NULL, '2026-02-08 23:15:24'),
(33, '0534921973', '83d14aafd139235053802aaf5b4a36af90e67eaac00321e396c7bc769f1bd9a6', '2026-02-08 23:18:09', 0, NULL, '2026-02-08 23:16:09'),
(34, '0534921973', '30882255fe33f8fe2bb254c3eb3348df16060517d9cb3fe57487382563e3839a', '2026-02-08 23:31:34', 0, NULL, '2026-02-08 23:29:34'),
(35, '0534921973', '908b7fc0b91d38deb5361338b13b844866b848f9d7e0dc2efe3d3a9fedc46be4', '2026-02-08 23:36:49', 0, NULL, '2026-02-08 23:34:49'),
(36, '0534921973', 'fc9c41b2d3b0484509054cd15bc75b42a031f36b31e147ece3a8f5182d14368e', '2026-02-08 23:38:54', 0, NULL, '2026-02-08 23:36:54'),
(37, '0534921973', '7409275015e2c6d69fea4db710dc0d30d6c4c99e46a21e971b381fcf9511abff', '2026-02-08 23:40:00', 0, NULL, '2026-02-08 23:38:00'),
(38, '0534921973', '39a9a270c3563f6dbb77651dd9fe1b3fcfdcd2561a89283354d312a939e8ccce', '2026-02-08 23:41:07', 0, NULL, '2026-02-08 23:39:07'),
(39, '0534921973', '7659eef148b0f1c6d43b996f35b937ab874abd0aa026d5ae76a26f15a70ee189', '2026-02-08 23:43:07', 0, NULL, '2026-02-08 23:41:07'),
(40, '0534921973', '10b4528a105d9dc5cd6eb2216169e9c7a08ba0cd4959b8e0d27a811bd92d0cca', '2026-02-08 23:43:43', 0, NULL, '2026-02-08 23:41:43'),
(41, '0534921973', '1018518472f0cae76c06e6f23871f51c3e05a3fd605ed7adce75edaa46c33db3', '2026-02-08 23:44:35', 0, NULL, '2026-02-08 23:42:35'),
(42, '0534921973', 'e0c7f5cff4495a9e5f747a8d6deab7a832245c03f48eebff2b2e771d3dfd85cc', '2026-02-08 23:48:22', 0, NULL, '2026-02-08 23:46:22'),
(43, '0534921973', 'acb9582ee41ad91416ee16af7a206e7b107d02f0e81871b70db951a9531a9e7a', '2026-02-08 23:49:42', 0, NULL, '2026-02-08 23:47:42'),
(44, '0534921973', '2d8024c7fe9adf4cd218cbd82596a87431442b704a8d7b5fafaf2f8215711563', '2026-02-08 23:49:46', 1, '2026-02-08 23:49:20', '2026-02-08 23:47:46'),
(45, '0534921973', '8abb31ff6cbbc4ab3fbaf7d15a177940c8c5638fe7b27c6b6554eb061f1c2e1f', '2026-02-08 23:52:28', 1, '2026-02-08 23:50:35', '2026-02-08 23:50:28'),
(46, '0534921973', '46e38f21108d7d9245b9603002f9a59ee8a3dbe9f1315d4896a40a89893174d6', '2026-02-08 23:54:03', 0, NULL, '2026-02-08 23:52:03'),
(47, '0534921973', '94b4ccf908e253f7e59ead4bcfe5a0f0ed8bd339f51417282a8f0bfb78743c51', '2026-02-08 23:55:04', 0, NULL, '2026-02-08 23:53:04'),
(48, '0534921973', '7114d181ac20b71142920baa1d66699cb95c7a0d2f5bb949942a8ae7129ce182', '2026-02-08 23:55:37', 0, NULL, '2026-02-08 23:53:37'),
(49, '0534921973', '6467e4c2e3e5098358438cb45c619bbe8b32654409e0a43af1a94a8aa94ae80e', '2026-02-08 23:56:01', 0, NULL, '2026-02-08 23:54:01'),
(50, '0534921973', '1f62af10e47bd9a0e38a6fd1d96877f02f9136baa10859fc796b5e7914a2a545', '2026-02-09 00:04:47', 0, NULL, '2026-02-09 00:02:47'),
(51, '0534921973', '0c8c4c720f59efe97df4e78cc473d63c42420a8fa4a0ba64a3540f07cfe76dc9', '2026-02-09 00:07:06', 0, NULL, '2026-02-09 00:05:06'),
(52, '0534921973', '3ad88635786740f4fb215f030623dbe633d72d60374a241bbd3b07d272fa5a1c', '2026-02-09 00:07:26', 0, NULL, '2026-02-09 00:05:26'),
(53, '0534921973', '5f6546fb2fd4d7b8b5e8f0f7b4f24f2e3380083b447b23e5cb9c306ea508da96', '2026-02-09 00:08:06', 0, NULL, '2026-02-09 00:06:06'),
(54, '0534921973', '2f7fdedd7bd60ce00262b7c458cbc1aab07df024bd38b957ff4bd20e12a0aadf', '2026-02-09 00:08:20', 0, NULL, '2026-02-09 00:06:20'),
(55, '0534921973', '2cc53a6287039c685a644eca3af1658777d22c937bd78c30da738fb829c299b9', '2026-02-09 00:09:14', 0, NULL, '2026-02-09 00:07:14'),
(56, '0534921973', '1394579709270d8f477877e58f153949b2af8b63ea015fa042af7e7040c47a91', '2026-02-09 00:09:19', 0, NULL, '2026-02-09 00:07:19'),
(57, '0534921973', 'a6cc505e79e2e1fead6420161838de1ad24ac12d0bb44c0a538515295c42c3a2', '2026-02-09 00:09:53', 0, NULL, '2026-02-09 00:07:53'),
(58, '0534921973', '4c9bf567f752971eb11c6e0dabfa8adee68556f07fe6894f53907a8154071d5e', '2026-02-09 00:10:14', 0, NULL, '2026-02-09 00:08:14'),
(59, '0534921973', '4f02fc0eed70cf1687f46e91d1aebaac6188df9e249e5ff68b8bc9da579a408e', '2026-02-09 00:10:21', 0, NULL, '2026-02-09 00:08:21'),
(60, '0534921973', 'e014d1ad51f29687497a2887da381a5b3185b107aed93105834fe814fc764917', '2026-02-09 00:10:59', 0, NULL, '2026-02-09 00:08:59'),
(61, '0534921973', 'bddd9be6580507eaec399324247d12775a8a81ccee739ca50f3a9c8923467c84', '2026-02-09 00:11:05', 0, NULL, '2026-02-09 00:09:05'),
(62, '0534921973', '1fdb3140db4e68c20f37fae81f5ad0e6135cec4e0d22cdd9309e6092f245a6f7', '2026-02-09 00:11:31', 0, NULL, '2026-02-09 00:09:31'),
(63, '0534921973', '29e59d713106910e08686dc2b0511b8f59fd56d221e05f2ff3283ead9badf3a2', '2026-02-09 00:12:21', 0, NULL, '2026-02-09 00:10:21'),
(64, '0534921973', '30f4f357e2c9aab7534d9fe23fdb6d537add2aa4abc098019a82c38eb2d0d34c', '2026-02-09 00:12:48', 0, NULL, '2026-02-09 00:10:48'),
(65, '0534921973', 'c278136c42d36ff05eb6d33a9fb23bf3a4f04e8adfa605e029d2b9db938036be', '2026-02-09 00:13:05', 0, NULL, '2026-02-09 00:11:05'),
(66, '0534921973', '4ab9cedd05c639ec129a8aa5d6a671087e41d4afe2666e1d5a8a5bd1b8bccc02', '2026-02-09 00:15:09', 0, NULL, '2026-02-09 00:13:09'),
(67, '0534921973', '9cad9a8bf464d70f2770519cb46c8374128fc694b6c183acdc97f910233bd8b9', '2026-02-09 00:16:10', 0, NULL, '2026-02-09 00:14:10'),
(68, '0534921973', 'acb7352002ebe88211180453dfbb28118cc3684aaffbb12a05b6e47dc5e2c34e', '2026-02-09 00:17:13', 0, NULL, '2026-02-09 00:15:13'),
(69, '0534921973', 'fb6ee093bdd9a7264f43072e98c0d628ff4d7b7a03eb677330b735933630a420', '2026-02-09 00:20:44', 0, NULL, '2026-02-09 00:18:44'),
(70, '0534921973', '84e4f63740bc490604d97147211f29fb003c0d17436fd84b7982d69a8b135426', '2026-02-09 00:21:14', 0, NULL, '2026-02-09 00:19:14'),
(71, '0534921973', '2005ade649911bbd1af32bcd4362e6c9abfa7802bf83529563775c5ce63ce5fc', '2026-02-09 00:21:33', 0, NULL, '2026-02-09 00:19:33'),
(72, '0534921973', 'b0ac874b51d4f4fa584d062377295a284eab88d452515acc7eda1c86ea7a3ec3', '2026-02-09 00:23:17', 0, NULL, '2026-02-09 00:21:17'),
(73, '0534921973', '717e87f9cba7eaf32204f00261e04aaec29ea8ac08a09fa9036e1ee170a19337', '2026-02-09 00:24:01', 0, NULL, '2026-02-09 00:22:01'),
(74, '0534921973', 'a1a2ca0c5afb8ff034172ce885c52709b958609c5a98c4e0249f62131d85b230', '2026-02-09 00:24:21', 0, NULL, '2026-02-09 00:22:21'),
(75, '0534921973', '0bd4f07ec6e2bd034ee5b6e12805d412affbdf78bf3d953c15959b4eee28c5d7', '2026-02-09 00:24:35', 0, NULL, '2026-02-09 00:22:35'),
(76, '0534921973', 'e94ec5f0351350e87e69defcc5e3039bb5a3c8e62a969cd57d4830235bb98894', '2026-02-09 00:26:45', 0, NULL, '2026-02-09 00:24:45'),
(77, '0534921973', '59dfbcf5a82110974f0420520e6c1d2bb65bd48130280d83992312d35ebb2d4f', '2026-02-09 00:26:47', 0, NULL, '2026-02-09 00:24:47'),
(78, '0534921973', 'c3f0dea7808467017434e3768ffb447533016ac86fc590548475048b4de5a5fc', '2026-02-09 00:27:42', 0, NULL, '2026-02-09 00:25:42'),
(79, '0534921973', '5d9c4840471305524ad46fbce6cd25ca38703f9cc267eca45165d5779a9e2875', '2026-02-09 00:28:05', 0, NULL, '2026-02-09 00:26:05'),
(80, '0534921973', '6c532c6cf6e089fcdf08e5a72c8eda250c7336eec48fd7a84ee4f3845d547799', '2026-02-09 00:28:10', 0, NULL, '2026-02-09 00:26:10'),
(81, '0534921973', 'c2e4379ad43f24607ed1aaffbae365a8bb0d7bb3c95438e468c44f11f2dabcfe', '2026-02-09 00:28:41', 0, NULL, '2026-02-09 00:26:41'),
(82, '0534921973', '14169371948d7ea835e779e28376d1fbec2edc7e374b6bae0823d4e09038c110', '2026-02-09 00:29:22', 0, NULL, '2026-02-09 00:27:22'),
(83, '0534921973', 'f03daf8372a62e7880e7d7bc012b03bf0be7ad74034bce333098223f974d7a4a', '2026-02-09 00:29:58', 0, NULL, '2026-02-09 00:27:58'),
(84, '0534921973', 'b4b310f9bb76a6fc526d6eb74e032046802c5321fcc81e53b8c53c8a8d3fa07c', '2026-02-09 00:30:05', 0, NULL, '2026-02-09 00:28:05'),
(85, '0534921973', 'b0e1561ab839e46cee87b499da6d881d81bbd060b0dd782f658d5b60f7bcc6e3', '2026-02-09 00:30:48', 0, NULL, '2026-02-09 00:28:48'),
(86, '0534921973', 'e5e3f264104ec9cc8915d5a920bf7c00244c69909d4f374b9da2c27a3403fb70', '2026-02-09 00:31:35', 0, NULL, '2026-02-09 00:29:35'),
(87, '0534921973', 'd1aea0feb85ed4c71c90c819e20b14a082b9383fa7fc162b1ce6d35898f3bd08', '2026-02-09 00:31:39', 0, NULL, '2026-02-09 00:29:39'),
(88, '0534921973', '5e2f9464111fa0b77b22102b730f1d477820fdcb8fd4c3ca84f9909a4fa03968', '2026-02-09 00:32:39', 0, NULL, '2026-02-09 00:30:39'),
(89, '0534921973', '635408edb3342fe901d88796c4e81976b31e1a3055b1b516514e030d8b7febc5', '2026-02-09 00:32:40', 0, NULL, '2026-02-09 00:30:40'),
(90, '0534921973', '9785f4cf2b6c2e8974cb5c54a3724082ed3fc75261f4d37d50318e3a08f6c194', '2026-02-09 00:32:41', 0, NULL, '2026-02-09 00:30:41'),
(91, '0534921973', '310fc277cf6a3a0215ecc98c40f6370025eb408e80a698f72a6d5574b9b51926', '2026-02-09 00:33:38', 0, NULL, '2026-02-09 00:31:38'),
(92, '0534921973', 'f900500d797ac34a2fc32bcbd1eba0f722337d40ece17e2fe3be985e19c401a4', '2026-02-09 00:33:48', 0, NULL, '2026-02-09 00:31:48'),
(93, '0534921973', '84e96f89e18b3871186162ace5ed9fca33ac024918c14717e08d4ac4c589156f', '2026-02-09 00:34:01', 0, NULL, '2026-02-09 00:32:01'),
(94, '0534921973', '1f9d8aecd082d0826fca617e692c5d52a77c4174e528bf5da0d49621b9d69c4b', '2026-02-09 00:34:17', 0, NULL, '2026-02-09 00:32:17'),
(95, '0534921973', '83d99057be81e2606ce151573b828831456238566f21c40eea58f02821ebe165', '2026-02-09 00:35:29', 0, NULL, '2026-02-09 00:33:29'),
(96, '0534921973', '5007d933058f362a70c544f3a091b8de5f8c3a91a96f40a683a1dc46c032d0d3', '2026-02-09 00:36:45', 0, NULL, '2026-02-09 00:34:45'),
(97, '0534921973', '70026fbe610afbdcf78511cef3a4c9fe515e425734a878625b0aae88d099ec52', '2026-02-09 00:37:25', 0, NULL, '2026-02-09 00:35:25'),
(98, '0534921973', 'f9ff7472c9bc03f93a8fac201e4cb27af95ef1a2e39fdeb602245093c5268473', '2026-02-09 00:37:27', 0, NULL, '2026-02-09 00:35:27'),
(99, '0534921973', '818c3d947b139e8438393f1315fac0376b0e5e6f849e7c72bc140c4a1883b0d3', '2026-02-09 00:38:49', 0, NULL, '2026-02-09 00:36:49'),
(100, '0534921973', '54253d465f362db740778d7dd05d1893a7933b1f88c4eb2bef16afdbf4c600bf', '2026-02-09 00:43:16', 0, NULL, '2026-02-09 00:41:16'),
(101, '0534921973', 'fc5d70809c62dd96e2ceb424d447c46fcede59d4cb4d8341a465cd21c9535d27', '2026-02-09 00:44:12', 0, NULL, '2026-02-09 00:42:12'),
(102, '0534921973', '76c3ef6338a4c6a33dd174849099398c5915854e768be1638b1dbfe8c63bc364', '2026-02-09 00:44:29', 0, NULL, '2026-02-09 00:42:29'),
(103, '0534921973', 'bac69f95e3d27c25a042b79c86e3ed9322b726d69ab37e3e1128e0797d77874a', '2026-02-09 00:47:15', 1, '2026-02-09 00:45:39', '2026-02-09 00:45:15'),
(104, '0534921973', 'de8bcf2daeed41e70a091f079ce0d589a9566e0dd3252c9885685ea141852cd7', '2026-02-09 00:50:52', 0, NULL, '2026-02-09 00:48:52'),
(105, '0534921973', '6b64637b269b2ca094692691b473c844b877f5124163d554e9d77d23bbe2d880', '2026-02-09 00:51:59', 0, NULL, '2026-02-09 00:49:59'),
(106, '0534921973', '5c0d66189caefd219cf6278e5c16df9ff88ab63887d42674b010846b67d16e30', '2026-02-09 00:55:09', 1, '2026-02-09 00:53:16', '2026-02-09 00:53:09'),
(107, '0534921973', 'b339a324f33645bdd4ea4aae2467cf1ffe2f544cc7b1c8339abab3ef8342f895', '2026-02-09 00:56:01', 0, NULL, '2026-02-09 00:54:01'),
(108, '0534921973', '4ecea63177a766a63c9ad4567cd05f727b56604eaac8e59423de0dbcf4754b00', '2026-02-09 00:56:50', 0, NULL, '2026-02-09 00:54:50'),
(109, '0534921973', '080ceb259ca2d9fcc99341d30cb4b975c1acb6c49eb07594167c9b2ba04cd87f', '2026-02-09 00:57:49', 1, '2026-02-09 00:55:57', '2026-02-09 00:55:49'),
(110, '0534921973', '10459e53953ef4daf62877ae202dd25af3bf624786ad27fe1cd6b5f3517d8c8e', '2026-02-09 01:00:46', 0, NULL, '2026-02-09 00:58:46'),
(111, '0534921973', '1ed7cdbc6508a1a18657bf8ca2afc02a855a16dfc02b3c46a680da9809949ac5', '2026-02-09 01:01:09', 1, '2026-02-09 00:59:27', '2026-02-09 00:59:09'),
(112, '0534921973', '343fb5779b8b64222ca495f03c7625d1231490d918b9cd23dedf66f140eba643', '2026-02-09 01:04:31', 0, NULL, '2026-02-09 01:02:31'),
(113, '0534921973', 'b422b983db8839057d60656b8af8f9665f694095702bfc0c3008b8ed7fedcfb7', '2026-02-09 01:04:48', 1, '2026-02-09 01:02:57', '2026-02-09 01:02:48'),
(114, '0534921973', '5cc353e921e458460451056c83c85b491ecc588a58de3d7fe1ef7109b6937575', '2026-02-09 01:05:18', 0, NULL, '2026-02-09 01:03:18'),
(115, '0534921973', '477e55e13655ea0b0c0671afd2ff0df91123d656cd9be4f8d6267be14db6b701', '2026-02-09 01:05:39', 1, '2026-02-09 01:03:45', '2026-02-09 01:03:39'),
(116, '0534921973', '8cfead5d62fc23139520b166c70d62a8b658ae958e88d827f9dea8bd5c062447', '2026-02-09 01:06:12', 0, NULL, '2026-02-09 01:04:12'),
(117, '0534921973', '7268e5796f32a3669154d8db7f4bd54a1c3b14c50bf1ccbe2135334f27ef797a', '2026-02-09 01:07:00', 0, NULL, '2026-02-09 01:05:00'),
(118, '0534921973', 'a559fac863691cbbc606a200ed60fabca2c33b6797192340548cd9e5a49ac7e4', '2026-02-09 01:07:58', 1, '2026-02-09 01:06:04', '2026-02-09 01:05:58'),
(119, '0534921973', 'fc585076cb85480b29cf3e44b5672e632d1a48aa05c1162af007f96fc308d417', '2026-02-09 01:08:22', 0, NULL, '2026-02-09 01:06:22'),
(120, '0534921973', '2186df9ee0673eed16119079ecc9b4a3f9a5c853df00d2497d486b3fdfdbec4a', '2026-02-09 01:08:41', 0, NULL, '2026-02-09 01:06:41'),
(121, '0534921973', '3ab0925b72317a8f1344e93a03244869a2c9173561f293a03814803af34fa6d6', '2026-02-09 01:09:01', 0, NULL, '2026-02-09 01:07:01'),
(122, '0534921973', '9403af1b9b67a6f4d9289ab909a0c4fb19216945e5d99545520ced591f9d737d', '2026-02-09 01:09:06', 0, NULL, '2026-02-09 01:07:06'),
(123, '0534921973', 'f7dce67b3c78ef70cd81f8272ff9b36e4e86f2dc0a8a38017e19fcdda770a9f0', '2026-02-09 01:09:25', 1, '2026-02-09 01:07:34', '2026-02-09 01:07:25'),
(124, '0534921973', 'e4fec4589ed4112fc450ecab61ec338d1b8ed1bb840fc547efdbda1fa43cc604', '2026-02-09 01:10:22', 0, NULL, '2026-02-09 01:08:22'),
(125, '0534921973', 'aaeecf3a45288b3da58a3a563f08d4be9c6c9c89f9aaafeeed52b35b77d580fd', '2026-02-09 01:10:37', 1, '2026-02-09 01:08:46', '2026-02-09 01:08:37'),
(126, '0534921973', '59ac1b2482954f914cc6c5441a0671a89d47966c8e8f5f295ea81742226881f3', '2026-02-09 01:11:09', 0, NULL, '2026-02-09 01:09:09'),
(127, '0534921973', 'e90b51e575c569581d2ecf0ab9704a70b499054a4c0a73c5c900804fb174d2c1', '2026-02-09 01:11:22', 0, NULL, '2026-02-09 01:09:22'),
(128, '0534921973', 'e62503c00d905a60e4f315ab6c7958d9e68edb3734954892be8fff03b8cbb3ef', '2026-02-09 01:14:14', 0, NULL, '2026-02-09 01:12:14'),
(129, '0534921973', '6bfa911d34c643c8d387ea4b0a0359049e9284fd18848d515bd6dd55335b5913', '2026-02-09 01:14:37', 1, '2026-02-09 01:12:46', '2026-02-09 01:12:37'),
(130, '0534921973', 'f32f8f9369934dcb1aee2a1726061b30c89773fe8706f1905024dbd357f10620', '2026-02-15 01:24:13', 0, NULL, '2026-02-15 01:22:13'),
(131, '0534921973', '18873a27d49ae16ac6cfa5476d908bdcae2f0f2b46bab408fc084fc77dbeaf84', '2026-02-15 01:26:38', 0, NULL, '2026-02-15 01:24:38'),
(132, '0534921973', '2a8b3825fe500fb9f5aced126a0f1e94e7c647738777e8dc7f883fcdaef817b2', '2026-02-15 01:28:41', 0, NULL, '2026-02-15 01:26:41'),
(133, '0534921973', '3bb5c4c2c111118e01ba1e75f976038357ebd4f3cc6b8485cd7a7866663d27c2', '2026-02-15 01:28:59', 0, NULL, '2026-02-15 01:26:59'),
(134, '0534921973', '975bed44202d3ec03e2f26c64a4d9562af25027ce6b2bfbfcf27c46da5bee6f5', '2026-02-15 01:31:41', 0, NULL, '2026-02-15 01:29:41'),
(135, '0534921973', 'd4c74b5f8dc9f60139c036aac12cfef89f5dd80278db50a057c24c258194d932', '2026-02-15 01:33:10', 0, NULL, '2026-02-15 01:31:10'),
(136, '0534921973', 'd6ef2909c88ee4adf1af0e187a4a2d621a995dbbadbf015801647cbdacfbff58', '2026-02-15 01:33:33', 0, NULL, '2026-02-15 01:31:33'),
(137, '0534921973', '72dfd12bb0c7aed74778f31a1c420b2f9c311e50744a9f0f9a62df64cb5d3b34', '2026-02-15 01:34:01', 0, NULL, '2026-02-15 01:32:01'),
(138, '0534921973', 'adda63298af3d0fec8c50dd4ab70e7bc7b4ffbb7d40e7290f9b7e34e80309f9b', '2026-02-15 20:36:46', 0, NULL, '2026-02-15 20:34:46'),
(139, '0534921973', '8bea9d434269c4e299e51c898b6213eb4ef8de217bcf4b7a363c6f32182f617d', '2026-02-15 20:36:49', 0, NULL, '2026-02-15 20:34:49');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `advertisements`
--
ALTER TABLE `advertisements`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `api_rate_limits`
--
ALTER TABLE `api_rate_limits`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ip` (`ip`),
  ADD KEY `route` (`route`);

--
-- Indexes for table `config1`
--
ALTER TABLE `config1`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `election_participants`
--
ALTER TABLE `election_participants`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user` (`national_id`);

--
-- Indexes for table `election_schedule_events`
--
ALTER TABLE `election_schedule_events`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_event_key` (`event_key`);

--
-- Indexes for table `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `final_results_approvals`
--
ALTER TABLE `final_results_approvals`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `final_submissions`
--
ALTER TABLE `final_submissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_final_submit_national_id` (`nationalId`),
  ADD UNIQUE KEY `nationalId` (`nationalId`);

--
-- Indexes for table `logs`
--
ALTER TABLE `logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `maxvotes`
--
ALTER TABLE `maxvotes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `objections`
--
ALTER TABLE `objections`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_tracking_code` (`tracking_code`),
  ADD KEY `idx_national_id` (`national_id`),
  ADD KEY `idx_status` (`status`);

--
-- Indexes for table `region`
--
ALTER TABLE `region`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `national_id` (`national_id`);

--
-- Indexes for table `userstatus`
--
ALTER TABLE `userstatus`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `nationalId` (`nationalId`);

--
-- Indexes for table `user_addresses`
--
ALTER TABLE `user_addresses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `user_documents`
--
ALTER TABLE `user_documents`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_user_docs_national_id` (`nationalId`),
  ADD UNIQUE KEY `nationalId` (`nationalId`);

--
-- Indexes for table `voters`
--
ALTER TABLE `voters`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `usernationalid` (`usernationalid`),
  ADD UNIQUE KEY `trackingCode` (`trackingCode`);

--
-- Indexes for table `votes`
--
ALTER TABLE `votes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_vote` (`national_id`,`candidate_id`);

--
-- Indexes for table `voting_tokens`
--
ALTER TABLE `voting_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_token` (`token_hash`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `advertisements`
--
ALTER TABLE `advertisements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `api_rate_limits`
--
ALTER TABLE `api_rate_limits`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=66;

--
-- AUTO_INCREMENT for table `config1`
--
ALTER TABLE `config1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `election_participants`
--
ALTER TABLE `election_participants`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `election_schedule_events`
--
ALTER TABLE `election_schedule_events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=348;

--
-- AUTO_INCREMENT for table `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `final_submissions`
--
ALTER TABLE `final_submissions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `logs`
--
ALTER TABLE `logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT for table `maxvotes`
--
ALTER TABLE `maxvotes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `objections`
--
ALTER TABLE `objections`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `user_addresses`
--
ALTER TABLE `user_addresses`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_documents`
--
ALTER TABLE `user_documents`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `voters`
--
ALTER TABLE `voters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `votes`
--
ALTER TABLE `votes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `voting_tokens`
--
ALTER TABLE `voting_tokens`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=140;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `user_addresses`
--
ALTER TABLE `user_addresses`
  ADD CONSTRAINT `user_addresses_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
